Jumperr-labs/jumper-nrf52-examples/components/libraries/cli/nrf_cli.c
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_ERROR,
                    "%s:%s%s\r\n",
                    argv[0],
                    m_nrf_cli_uknown_parameter,
                    argv[1]);
}

NRF_CLI_CMD_REGISTER(clear, NULL, "Clear screen.", nrf_cli_cmd_clear);

#if NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_colors)
{
    NRF_CLI_CMD(off, NULL, "Disable colored syntax.", nrf_cli_cmd_colors_off),
    NRF_CLI_CMD(on,  NULL, "Enable colored syntax.",  nrf_cli_cmd_colors_on),
    NRF_CLI_SUBCMD_SET_END
};
NRF_CLI_CMD_REGISTER(colors, &m_sub_colors, "Toggle colored syntax.", nrf_cli_cmd_colors);
#endif

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_echo)
{
    NRF_CLI_CMD(off, NULL, "Disable CLI echo. Escape codes are not handled.", nrf_cli_cmd_echo_off),
    NRF_CLI_CMD(on,  NULL, "Enable CLI echo. Escape codes are handled.",  nrf_cli_cmd_echo_on),
    NRF_CLI_SUBCMD_SET_END
};
NRF_CLI_CMD_REGISTER(echo, &m_sub_echo, "Toggle CLI echo.", nrf_cli_cmd_echo);

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
NRF_CLI_CMD_REGISTER(history, NULL, "Command history.", nrf_cli_cmd_history);
#endif

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_resize)
{
    NRF_CLI_CMD(default,
                NULL,
                "Assume 80 chars screen width and send this settings to the terminal.",
                nrf_cli_cmd_resize_default),
    NRF_CLI_SUBCMD_SET_END
};
NRF_CLI_CMD_REGISTER(resize,
                     &m_sub_resize,
                     "Console gets terminal screen size or assumes 80 in case readout fails. "
                     "It must be executed after each terminal width change to ensure correct "
                     "text display.",
                     nrf_cli_cmd_resize);

#if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_cli_stats)
{
    NRF_CLI_CMD(get,   NULL, "Get CLI statistics for LOG module.",   nrf_cli_cmd_cli_stats_get),
    NRF_CLI_CMD(reset, NULL, "Reset CLI statistics for LOG module.", nrf_cli_cmd_cli_stats_reset),
    NRF_CLI_SUBCMD_SET_END
};
NRF_CLI_CMD_REGISTER(cli_stats,
                     &m_sub_cli_stats,
                     "CLI statistics.",
                     nrf_cli_cmd_cli_stats);
#endif // NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)

#endif // NRF_MODULE_ENABLED(NRF_CLI_BUILD_IN_CMDS)

#endif // NRF_MODULE_ENABLED(NRF_CLI)
